# St7DisableNSMassCaseInMassMatrix

Disables the non-structural mass for the specified load case such that it is not included in mass matrix for natural
frequency and transient dynamic analysis.

long St7DisableNSMassCaseInMassMatrix(long uID, long CaseNum)
Input Parameters
uID
Strand7 model file ID.
CaseNum
Load case number.